[
    { 
        "id": 1,
        "title": "Think",
        "date": "2023-2024",
        "platform": ["Android", "Ios"],
        "link": ["https://play.google.com/store/apps/details?id=com.ClinicofHope.Think&hl=es_GT", "https://apps.apple.com/us/app/think-a-learning-game/id6443926053"],
        "role": ["Gameplay Programmer", "Level Designer", "Game Tester"],
        "description": "Think is a *2D platformer* made by *The Clinic of Hope* for mobile devices.\nThe game is aimed at enhancing children's problem-solving skills through engaging gameplay.",
        "contributions": ["Designed over 40 Levels, each featuring unique challenges and themes.",
        "Conceptualized and implemented various game modes to enhance gameplay diversity:• Lights Off: Navigate levels in darkness while collecting energy to power a flashlight, implemented lighting mechanics and energy management systems to create a tense, immersive experience.•Endless Runner: an infinite mode by utilizing Unity Addressables to dynamically load and combine randomized segments from story levels, providing endless replayability.•Survivor: Survive waves of enemies, collecting temporary power-ups.•Speed Run: a time-limited speedrun event with a Firebase-backed leaderboard system to track and reward top player performances.",
        "Designed and implemented a persistent high-score system across all game modes, with Firebase cloud saves to track and compare scores.",
        "Created dynamic visual effects using Unity's Particle System",
        "Contributed to 2D art: designed Tilesets, Enemy sprites and UI assets",
        "Implemented a Character Upgrade System allowing players to enhance attributes (e.g., speed, invincibility) via in-game currency.",
        "Refactored and optimized core gameplay scripts to improve performance, reduce load times, and enhance game responsiveness.",
    "Introduced new animations for the Menu UI to avoid static screens and make the interface more interactive."],
        "images": ["https://lh3.googleusercontent.com/d/12ER685ExqcoOGDJKzXsRMFx-9hLDlXFq", "https://lh3.googleusercontent.com/d/1rQlBSQvzvheq6mntK5-CtEftgSCC-CMu"],
        "icon": "https://lh3.googleusercontent.com/d/1akFMtnrsYYpsunDK2fVXdMDCbH2NtEza"
    },
    {
        "id": 2,
        "title": "Assets Made",
        "link": ["/"],
        "description": "Some of the Assets I made for Unity",
        "images": ["https://user-images.githubusercontent.com/10498744/210012254-234538ff-d198-48aa-8964-37e6fd45d227.gif"],
        "icon": "https://lh3.googleusercontent.com/d/1u6XyafUxFmDPWEnKT_FhQiHYu_JdQdi6"
    }
]